//Задача 1
//В файле task_1.html создайте базовый HTML-код и подключите к нему JavaScript-файл task_1.js. Создайте функцию с названием createStudentCard() в файле task_1.js, принимающую два параметра: name и age. Функция должна создавать карточку студента внутри элемента body HTML-страницы. Карточка студента представляет собой DOM-элемент, а именно тег div, внутри которого находится заголовок h2 с именем студента из параметра name и span под заголовком с возрастом студента (age). При желании можно украсить элементы CSS-стилизацией.

//Задача 2
//Скопируйте код из файлов task_1.html и task_1.js в файлы task_2.html и файл task_2.js соответственно. Доработайте функцию createStudentCard() так, чтобы она принимала не два параметра с информацией о студенте, а один — student, который является объектом с информацией о студенте. Функция делает то же самое, что и в первой задаче, — создаёт карточку студента.

//Задача 3
//В файле task_3.html создайте базовый HTML-код и подключите к нему JavaScript-файл task_3.js. Создайте массив объектов студентов. Создайте функцию с названием createStudentsList() в файле task_3.js, принимающую один параметр listArr. Функция должна создавать список ul с карточками студентов, основанный на переданном в функцию массиве студентов. Для решения задачи лучше всего использовать цикл внутри функции createStudentsList(). При желании можно украсить элементы CSS-стилизацией.

//Задача 4
//Скопируйте код из файлов task_3.html и task_3.js в файлы task_4.html и файл task_4.js соответственно. Отличие задачи в том, что новый список студентов должен быть отображён на странице после клика по заранее созданной кнопке. Создайте кнопку button с текстом внутри «Показать список». Привяжите к кнопке событие клика. При клике должна быть вызвана ранее созданная функция createStudentsList() и под кнопкой должен появиться список студентов.
